
# La llave principal (m,a, n) es el momento del día. La llave secundaria (1,2,3) es el valor de la variable en el tiempo t
# El diccionario interior son los valores en t+1 con su respectiva probabilidad
# 'm': {1: {1: 0.7, 2: 0.2, 3: 0.1} -> En este caso: Si es de mañana y el valor en t es 1, hay un 70% de probabilidad de permanecer en 1, 20% de transicionar a 2 y 10% de transicionar a 3

L_trans_probs = {
    'm': {
        1: {1: 0.7, 2: 0.2, 3: 0.1},
        2: {1: 0.2, 2: 0.6, 3: 0.2},
        3: {1: 0.1, 2: 0.3, 3: 0.6},
    },
    'a': {
        1: {1: 0.6, 2: 0.3, 3: 0.1},
        2: {1: 0.2, 2: 0.5, 3: 0.3},
        3: {1: 0.1, 2: 0.3, 3: 0.6},
    },
    'n': {
        1: {1: 0.6, 2: 0.3, 3: 0.1},
        2: {1: 0.2, 2: 0.5, 3: 0.3},
        3: {1: 0.1, 2: 0.2, 3: 0.7},
    }
}

G_trans_probs = {
    'm': {
        0: {0: 0.6, 1: 0.3, 2: 0.1, 3: 0.0},
        1: {0: 0.2, 1: 0.5, 2: 0.3, 3: 0.0},
        2: {0: 0.1, 1: 0.3, 2: 0.6, 3: 0.0},
        3: {0: 0.1, 1: 0.2, 2: 0.5, 3: 0.2},
    },
    'a': {
        0: {0: 0.4, 1: 0.3, 2: 0.2, 3: 0.1},
        1: {0: 0.2, 1: 0.4, 2: 0.3, 3: 0.1},
        2: {0: 0.1, 1: 0.2, 2: 0.4, 3: 0.3},
        3: {0: 0.05, 1: 0.15, 2: 0.3, 3: 0.5},
    },
    'n': {
        0: {0: 1.0, 1: 0.0, 2: 0.0, 3: 0.0},
        1: {0: 1.0, 1: 0.0, 2: 0.0, 3: 0.0},
        2: {0: 1.0, 1: 0.0, 2: 0.0, 3: 0.0},
        3: {0: 1.0, 1: 0.0, 2: 0.0, 3: 0.0},
    }
}

